<template>
    <div class="xypage">
        <slot name="header">
            <div class="header">用户付费协议</div>
        </slot>
        <slot name="content">
            <div v-html="text" class="content">

            </div>
        </slot>
        <slot name="footer">
            <div @click="emit('sub')" class="footer active">
                知道了
            </div>
        </slot>
    </div>
</template>
<script>
export default {
  name: 'xypage',
  data() {
    return {
      name: 'xypage',
      text: '优税管家购买协议<br>'
            + ' <br>'
            + '1.   协议条款的确认和接纳<br>'
            + '1.1 欢迎使用优税学管家服务，请您仔细阅读以下全部内容（特别是粗体标注的内容）。本协议是您与优税管家之间关于购买优税管家下的产品以及VIP会员服务的条款，内容包括本协议正文、《优税管家用户服务协议》、《优税管家用户付费协议》、本协议明确援引的其他协议及优税管家已经发布的或将来可能发布的各类协议和规则。所有协议内容为本协议不可分割的组成部分，与本协议正文具有同等法律效力。除另行明确声明外，您使用优税管家以及VIP会员服务的行为将受本协议约束。<br>'
            + '1.2 您应该具备中华人民共和国法律规定的与您行为相适应的民事行为能力。若您不具备签署与您行为相适应的民事行为能力，请确保您的监护人同意您的所有行为，在此情况下，您及您的监护人应依照法律规定承担因此而导致的一切后果。如您选择“点击同意”本协议或者以其他方式开始使用优税管家以及其VIP会员权益功能服务，即表示已经与优税管家达成协议，并自愿接受本协议的所有内容。<br>'
            + '1.3 优税管家有权根据法律规范及运营的合理需要，不断修改和完善本协议，并在优税管家平台（www.utax360.cn）公告。如您继续使用优税管家以及VIP会员服务，即意味着同意并自愿遵守修改后的协议条款，亦或您有权终止使用。<br>'
            + ' <br>'
            + '2.   定义<br>'
            + '1.1.  您：指经过付费选择特定类型的服务成为优税管家以及VIP会员（以下简称“会员”）的优税管家的用户。<br>'
            + '1.2.  优税管家平台（或优税管家不时修改的其他名称，以下简称“优税管家”）：指由优税管家所有和经营的，供优税管家用户查询、数字内容聚合平台，旨在为优税管家用户提供课程教学，工具类产品使用，内容服务、传播和消费服务。<br>'
            + '1.3.  VIP会员权益：指会员在注册成功后，根据向优税管家支付对价，所获得的针对的优惠购买价格、课程免费观看资格、产品功能使用、优惠券礼包及其他会员特有优惠权益，具体内容以优税管家官网、相关页面上发布的公告、规则为准（以下简称“会员权益”）。 <br>'
            + '2.   服务内容<br>'
            + '2.1.  除非另有证明，优税管家储存在其服务器上的数据是您享有会员权益的唯一有效证据。<br>'
            + '2.2.  您可以选择不同的服务类型，包括但不限于月度会员、年度会员，并支付相应的对价来获得不同的会员资格。<br>'
            + '2.3.  会员资格的有效期根据您选择的服务类型确定。<br>'
            + '2.4.  您在成为会员后，可以观看免费课程，法规资讯、使用产品也可以优惠价格购买课程以及产品。<br>'
            + '2.5.  会员资格有效期届满前，您可以通过续费来继续享受会员权益。有效期届满的，对应的所有服务以及权限将无法继续使用。<br>'
            + ' <br>'
            + '3.   付费规则<br>'
            + '3.1.  如果您希望获得会员权益，需要先登录或注册优税管家账号。您在使用优税管家会员服务时登录的账号是优税管家确认您身份的唯一依据。<br>'
            + '3.2.  您理解并同意：优税管家提供的优税管家会员权益实行先付款后使用的方式，您及时、足额、合法的支付所需的款项是您享受会员权益的前提。您有权选择使用优税管家认可的支付方式，如果该支付方式由优税管家之外具备合法资质的第三方提供，该等支付服务的使用条件及规范由您与支付服务提供方确定，与优税管家认可无关。<br>'
            + '3.3.  优税管家将不对所提供的会员权益的适用性或满足您特定需求及目的进行任何明示或者默示的担保。请您在购买前确认自身的需求，同时仔细会员权益的详细说明。<br>'
            + '3.4.  您理解并同意，会员权益属于在线虚拟服务内容，一旦购买成功，除法律规定的情形及本协议另有约定外，优税管家不予退还已收取的费用。<br>'
            + '3.5.  您知悉并同意，您购买的会员权益仅限于您自行使用，您无权对已购买的会员权益进行出售、转让、许可或其他方式使除您自己以外的第三方（包括但不限于自然人、法人或其他组织）使用已购买的会员权益。若您违反本条款规定，优税管家有权视情况采取如下措施而无需承担任何责任：<br>'
            + '3.5.1. 取消您继续享用会员权益的权利；<br>'
            + '3.5.2. 限制、冻结、终止您的账号；<br>'
            + '3.5.3. 要求您退还其通过出售、转让、许可等其他方式取得的收益；<br>'
            + '3.5.4. 其他优税管家认为可以采取的救济措施。<br>'
            + '3.6.  您应保管好自己的账号和密码（包括但不限于登录/支付账号），如因您未保管好自己的账号和密码而对自己、优税管家或第三方造成损害的，您将负全部责任。另外，您应对用户账号中的所有活动和事件负全责。<br>'
            + '3.7.  您同意如果发现有非法使用您账号或出现安全漏洞的情况，应立即通告优税管家，优税管家将会尽力予以妥善解决。<br>'
            + ' <br>'
            + '4.   其他约定<br>'
            + '4.1.  您理解并同意，本协议是您与优税管家已签署的《优税管家用户付费协议》或类似文件的补充协议，与该等协议的约定不一致之处，以本协议为准。本协议中未涉及的内容以《优税管家用户付费协议》或类似文件的内容为准。<br>'
            + '4.2.  优税管家根据自身商业决策等原因可能会选择终止优税管家以及会员服务功能。您同意优税管家有权行使上述权利且不需对您或第三方承担任何责任。如有此等情形发生，优税管家会采取公告或其他合适的形式通知您，并以您购买会员服务但未实际使用（即您付费购买会员服务后尚有剩余到期时间）的费用为限，将上述费用（如有）返还至您的购买账户中。除法律有明确规定的情况外，优税管家有权不经您申请并直接为您办理退款。<br>'
            + '4.3.  经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者优税管家根据自身的判断，认为您的行为涉嫌违反《优税管家服务协议》、《优税管家用户付费协议》、本协议内容或优税管家分不时公布的使用规则等内容，或涉嫌违反法律法规的规定的，则优税管家有权中止、中断或终止向您提供服务，并无需向您退还任何费用以及不承担任何责任。<br>'
            + '4.4.  优税管家对不可抗力导致的损失不承担责任。本协议所指不可抗力包括但不限于：天灾、法律法规或政府指令的变更，因网络服务特性而特有的原因，例如境内外基础电信运营商的故障、 计算机或互联网相关技术缺陷、互联网覆盖范围限制、计算机病毒、黑客攻击等因素，及其他合法范围内的不能预见、不能避免并不能克服的客观情况。<br>'
            + '4.5.  所有发给您的通知都可通过电子邮件、常规的信件或在优税管家网站显著位置公告的方式进行传送。任何对本协议的修改，自修改后的协议在在优税管家网站公布或以电子邮件、常规的信件等方式向您通知之日起生效。<br>'
            + '4.6.  本协议自发布之日起生效并实施，构成您和优税管家之间的共识。<br>'
            + '4.7.  本协议适用中华人民共和国的法律（不含冲突法）。当本协议的任何内容与中华人民共和国法律相抵触时，应当以法律规定为准，同时相关内容将按法律规定进行修改或重新解释，而本协议其他部分的法律效力不变。<br>'
            + '4.8.  凡因本协议引起的或与本协议有关的任何争议，均应提交中国国际经济贸易仲裁委员会，按照申请仲裁时该会现行有效的仲裁规则进行仲裁，并由3名仲裁员进行审理。仲裁裁决是终局的，对双方均有约束力。<br>'
            + '4.9.  如您对本协议内容有任何疑问，请致电我们的客服邮箱：4008-198-618。',
    };
  },
  props: {
    src: { // 更多
      type: String,
      default: () => '',
    },
  },
  mounted() {
    this.init();
  },
  methods: {
    init() {
    },
  },
};
</script>
<style scoped>
    .xypage {
        position: absolute;
        display: block;
        left: 0;
        top: 0;
        right: 0;
        bottom: 0;
        box-sizing: border-box;
        padding: 50px 0;
    }

    .header,
    .content,
    .footer {
        display: block;
        width: 100%;
        overflow-x: hidden;
        overflow-y: auto;
        position: relative;
        height: 100%;
        font-size: 14px;
        color: #444;
        word-break: break-all;
        line-height: 21px;
        box-sizing: border-box;
    }

    .content {
        padding: 15px;

    }

    .footer,
    .header {
        height: 50px;
        width: 100%;
        text-align: center;
        font-size: 16px;
        color: #444444;
        position: absolute;
        left: 0;
        line-height: 50px;
    }

    .header {
        top: 0;
        border-bottom: 1px solid #f1f1f1;
    }

    .footer {
        bottom: 0;
        color: #FB683C;
        font-weight: bold;
        border-top: 1px solid #f1f1f1;
    }
</style>
